# SQL Exercise (10 points)

Complete this exercise using SQLite. 

To work with SQLite, first install `ipython-sql` (e.g., via 'pip install ipython-sql').

## Part 1 (4 points)

(1.1) Create the following table named `Products` that has 4 columns with 10 records. Set the `Code` column to be the Primary Key. 

If you have many errors in your code, it helps to restart the kernel by clicking on `Kernel` -> `Restart Kernel` in the top menu, and run again the cells.

In [12]:
%load_ext sql

%%sql sqlite://
CREATE TABLE Products(
    id INTEGER NOT NULL PRIMARY KEY,
    name VARCHAR(50) NOT NULL,
    price REAL,
    manufacturer VARCHAR(50) NOT NULL);

INSERT INTO Products(name, price, manufacturer) VALUES('Hard drive', 240, 'Sony');
INSERT INTO Products(name, price, manufacturer) VALUES('Memory', 120, 'Winchester');
INSERT INTO Products(name, price, manufacturer) VALUES('ZIP Drive', 150, 'Iomega');
INSERT INTO Products(name, price, manufacturer) VALUES('Floppy Disk', 5, 'Creative Labs');
INSERT INTO Products(name, price, manufacturer) VALUES('Monitor', 240, 'Fujitsu');
INSERT INTO Products(name, price, manufacturer) VALUES('DVD Drive', 180, 'Creative Labs');
INSERT INTO Products(name, price, manufacturer) VALUES('CD Drive', 90, 'Creative Labs');
INSERT INTO Products(name, price, manufacturer) VALUES('Printer', 270, 'Hewlett-Packard');
INSERT INTO Products(name, price, manufacturer) VALUES('Toner cartridge', 66, 'Hewlett-Packard');
INSERT INTO Products(name, price, manufacturer) VALUES('DVD Burner', 180, 'Iomega');

SyntaxError: invalid syntax (2963703628.py, line 4)

(1.2) Select the names of all the products in the store.

In [9]:
# Your code here

(1.3) Select the names of the products with a price less than or equal to $200. Display product names and prices.

In [10]:
# Your code here
%load_ext sql
%%sql sqlite://

CREATE TABLE products(
    id INTEGER NOT NULL PRIMARY KEY,
    name VARCHAR(50) NOT NULL,
    price REAL,
    manufacturer VARCHAR(50));

(1.4) Select all products with a price between $60 and 200. Display product names and prices, sorted by ascending price.

In [ ]:
# Your code here

(1.5) Select the name and price of all products, and display the price in cents (instead of dollars).

In [ ]:
# Your code here

(1.6) Compute the average price of all products from the manufacturer 'Creative Labs'.

In [ ]:
# Your code here

(1.7) Compute the number of products with a price larger than or equal to $180.

In [ ]:
# Your code here

(1.8) Select the name and price of all products with a price larger than or equal to $180, and sort them by price in descending order.

In [ ]:
# Your code here

(1.9) Select the manufacturers and the average price of each manufacturer's products.

In [ ]:
# Your code here

(1.10) Select the manufacturers whose products have an average price larger than or equal to $160.

In [ ]:
# Your code here

(1.11) Select the name and price of the cheapest product.

In [ ]:
# Your code here

(1.12) Select the name of each manufacturer along with the name and price of its most expensive product, and sort them by price in descending order.

In [ ]:
# Your code here

(1.13) Update the name of product 8 to "Laser Printer", and display the updated names.

In [ ]:
# Your code here

(1.14) Apply a 10% discount to all products. Display the product names and updated prices.

In [ ]:
# Your code here

(1.15) Apply an additional 20% discount to all products with a price larger than or equal to $120.

In [ ]:
# Your code here

Delete the table from Part 1.

In [ ]:
# Your code here

# Part 2 (3 points)

Run the code in the following cell to create a database containing information about employees and departments in a small business.

In [7]:
%%sql sqlite://
CREATE TABLE Departments (
  Code INTEGER PRIMARY KEY,
  Name varchar(255) NOT NULL ,
  Budget decimal NOT NULL 
);

CREATE TABLE Employees (
  SSN INTEGER PRIMARY KEY,
  Name varchar(255) NOT NULL ,
  LastName varchar(255) NOT NULL ,
  Department INTEGER NOT NULL , 
  foreign key (department) references Departments(Code) 
);

INSERT INTO Departments(Code,Name,Budget) VALUES(14,'IT',65000);
INSERT INTO Departments(Code,Name,Budget) VALUES(37,'Accounting',15000);
INSERT INTO Departments(Code,Name,Budget) VALUES(59,'Human Resources',240000);
INSERT INTO Departments(Code,Name,Budget) VALUES(77,'Research',55000);

INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('123234877','Michael','Rogers',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('152934485','Anand','Manikutty',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('222364883','Carol','Smith',37);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('326587417','Joe','Stevens',37);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('332154719','Mary-Anne','Foster',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('332569843','George','ODonnell',77);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('546523478','John','Doe',59);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('631231482','David','Smith',77);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('654873219','Zacary','Efron',59);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('745685214','Eric','Goldsmith',59);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('845657245','Elizabeth','Doe',14);
INSERT INTO Employees(SSN,Name,LastName,Department) VALUES('845657246','Kumar','Swamy',14);

UsageError: Cell magic `%%sql` not found.

(2.1) Select the last name of all employees.

In [ ]:
# Your code here

(2.2) Select the last name of all employees, without duplicates. Sort them in alphabetical order.

In [ ]:
# Your code here

(2.3) Select all the data of employees whose last name is "Smith" or "Doe".

In [ ]:
# Your code here

(2.4) Select all the data of employees whose last name begins with an "S".

In [ ]:
# Your code here

(2.5) Select the number of employees in each department, and display the name of each department and the number of employees per department.

In [ ]:
# Your code here

(2.6) Select the name and last name of employees working for the departments that have a budget greater than $60,000.

In [ ]:
# Your code here

(2.7) Select the names of departments with more than two employees (e.g., you can use a subquery).

In [ ]:
# Your code here

(2.8) Reduce the budget of all departments by 10%. Display the Departments table to verify the changes.

In [ ]:
# Your code here

(2.9) Reassign all employees from the Research department (code 77) to the IT department (code 14). Display the Employees table to verify the change.

In [ ]:
# Your code here

(2.10) Delete the tables in the current database.

In [ ]:
# Your code here

# Part 3 (3 points)

(3.1) Connect to the database named `demo.db` located in the `data` folder.

In [ ]:
# Your code here

(3.2) Select the names of all tables in the database.

In [ ]:
# Your code here

(3.3) Select the names of all categories in the Category table.

In [ ]:
# Your code here

(3.4) Select the names of all categories, description of categories, and the number of products per category (e.g., use the `CategoryID` column in the `Product` table to relate to the `ID` column in the `Category` table).

In [ ]:
# Your code here

(3.5) From the `Customer` table, select the names of 3 countries with the largest number of customers per country (e.g., use the `Country` column in the `Customer` table, and create a subquery for the number of customers per country).

In [ ]:
# Your code here

(3.6) Count the number of discontinued products (in the `Product` table, 1 in the `Discontinued` column means that the product is discontinued).

In [ ]:
# Your code here

(3.7) Select products that cost between $20 and 25 and are not discontinued. Display product name and unit price, sorted by price in descending order.

In [ ]:
# Your code here

(3.8) Select the five most expensive products, and display the product name and unit price.

In [ ]:
# Your code here